print('Добрый день, введите количество персон:')
n = int(input())
cook_book = [
  ['салат',
      [
        ['картофель', 100, 'гр.'],
        ['морковь', 50, 'гр.'],
        ['огурцы', 50, 'гр.'],
        ['горошек', 30, 'гр.'],
        ['майонез', 70, 'мл.'],
      ]
  ],
  ['пицца',  
      [
        ['сыр', 50, 'гр.'],
        ['томаты', 50, 'гр.'],
        ['тесто', 100, 'гр.'],
        ['бекон', 30, 'гр.'],
        ['колбаса', 30, 'гр.'],
        ['грибы', 20, 'гр.'],
      ],
  ],
  ['фруктовый десерт',
      [
        ['хурма', 60, 'гр.'],
        ['киви', 60, 'гр.'],
        ['творог', 60, 'гр.'],
        ['сахар', 10, 'гр.'],
        ['мед', 50, 'мл.'],  
      ]
  ]
]
print('Для приготовления блюда на {0} персон(ы), вам потребуется приобрести :'.format(n))
print('')

for i in range(len(cook_book)):
    for k in cook_book[i]:
        if type(k) is str:
            print(k,':')
        else:
            for y in k:
                print(y[0],', ', y[1]*n, y[2], sep='')
    print('')

            
    

        

        
        

